#Токен для бока
token = '5157122260:AAFdmb7QLQkRlIq5eAle5iv_VkqkVafnirY'

#Текста для сообщений
text_logo = """👨‍💻 Школа детского программирования 👩‍💻
📲Обучаем детей от 5 до 18 лет навыкам IT
💯Улучшаем английский и логику
🆓Запишись на пробный бесплатный урок
"""
o_nas = """Чему учат в школе COD ?
✔Создавать веб-страницы, сайты и игры.
✔Писать профессиональный код с самого начала.
✔Думать логически и решать проблемы.
✔Развивать креативное и критическое мышление.
✔Знать все о новейших технологиях в сфере IT и быть компьютерно грамотным.
✔Достигать поставленных целей.
✔Работать в команде.

С помощью COD ты можешь программировать собственные интерактивные истории, игры и мультфильмы, а затем делиться своими творениями с другими участниками онлайн-сообщества."""

faq1 = '''❓ С чего начать?

✅ Если вы хотите привить интерес ребёнку к сфере информационных технологий в самом раннем возрасте, то следует начать с курсов Scratch или Kodu Game Lab. Они представляют собой редактор для визуального программирования, т.е. программирования из готовых блоков. У ребёнка нет необходимости самостоятельно писать код на иностранном языке, что не отпугивает малыша от программирования, также ученик сразу видит результат своей работы, что дополнительно мотивирует ребёнка.

✅ Если вас интересует карьерный старт в сфере ИТ, то следует начать с курсов по графическому дизайну или Python. Python является как самостоятельно применимым языком, так и отличной базой для дальнейшего изучения высокоэффективных низкоуровневых языков. Разница состоит лишь в том, что Python проще для изучения, т.к. обладает автоматической обработкой данных, что упрощает работу для разработчика.
'''

faq2 = '''❓ Что даст курс?

✅В зависимости от выбранного направления курс даст либо начальное представление о программировании, его принципах и построении программы, либо даст уверенный старт в профессии. По окончании курса вы получаете сертификат государственного образца о дополнительном образовании.
'''

faq3='''❓ Не навредят ли занятия зрению или психике ребёнка?

✅ По мнению врачей и психологов с 3-4х доступ ребёнка к компьютеру/планшету становится безопасным для его психики и развития, но нужно следить за временем нахождения с "виртуальными друзьями", для таких малышей он составляет не более 15-20 минут в день.

✅ Наши ученики возрастом от 7-ми лет, в этом возрасте оптимальное время провождения за компьютером составляет 1,5 часа, что мы и обеспечиваем перерывами и прогонкой теории, при которой глаза ребенка не напрягаются, глядя в экран монитора.

✅ С 10-ти лет ребенок спокойно может находиться за монитором по 2 часа, это уже не может навредить его здоровью и психике.

✅ Что же касается развития ребенка? Не затормозит ли его компьютер? Вовсе нет, даже наоборот! По мнению психологов, работа за компьютером (в формате учёбы, работы, даже игры или просмотра видео), требует умственной активности, что является стимуляцией развития аналитико-синтетического мышления, а также способствует повышению обучаемости ребёнка, ведь даже во время игры или просмотра видео развиваются навыки чтения и формирования мыслей в связный текст, что уж говорить об обучении программированию.

✅ Поэтому мы с уверенностью можем заявить, что наши занятия совсем не вредны для ваших детей, напротив, это стимулирует их развитие, чему, конечно, подсобят и наши преподаватели.

'''

faq4 = '''❓ В каком формате проходят занятия?

✅ Мы понимаем, что ребятам трудно усидеть на одном месте, поэтому изначально отказались от стандартных школьных установок, на наших уроках не нужно отпрашиваться, чтобы выйти, сидеть до упора, даже если устал. Мы поддерживаем дисциплину с помощью дружеской обстановки и авторитета преподавателя. Когда ребятам интересно, они сами не желают срывать урок.

✅ Мы составили оптимальное расписание, чтобы у ребят было время на отдых и общение друг с другом.

✅ Наш урок длится 2 часа:

 🔔 50 мин ребята работают, изучают новый материал и обсуждают волнующие их вопросы по теории
 🔔 15 мин. перерыв, разминка. Преподаватель играет с ребятами. В нашем арсенале есть различные игры - на знакомство, сближение, просто подвижные игры. Это позволяет разрядить атмосферу, чтобы с новыми силами вернуться в бой.
 🔔 50 мин. ребята применяют полученные знания на более серьёзных проектах, преподаватель поясняет работу программ и помогает ученикам воплотить их задумки в жизнь.

✅ Мы против жёстких рамок, криков, давления и однообразных проектов. Мы считаем, что наша задача - помочь ребёнку самореализоваться и выплеснуть свой творческий потенциал, используя навыки, полученные в нашей школе.
'''

faq5='''❓ Какова стоимость занятий?

✅ Первое занятие – ознакомительное, оно абсолютно бесплатное и ни к чему вас не обязывает. Мы специально ввели ознакомительный мастер-класс для того, чтобы ученик мог понять, близко ли ему направление выбранного курса или, возможно, стоит продолжить поиски.
✅ Далее стоимость занятий варьируется от выбранного направления и составляет от 2300 руб/мес до 3500 руб/мес для детей и подростков. Возможна беспроцентная рассрочка до года. 
'''


kont = '''ПН-ПТ: 11:00 - 20:00
ПТ-ВС: 10:00 - 21:00

Телефон (Whats Up/Telegram): 88162686158
Почта: codschool@gmail.com'''

kurs_pyth = '''Присоединяйся к нашей дружной команде и создай свой игровой мир💻
🐍Курс Python Start - это ...
✅ Изучение основ языка программирования Python
✅ Решение реальных задач, используя Python
✅ Создание графических объектов
✅ Разработка игр, используя библиотеку PyGame/Play
✅ Изучение основ объектно-ориентированного программирования'''

kurs_grafdisn = '''Курс направлен на обучение ребят созданию гармоничной визуально-коммуникационной среды.

В программу курса входит:

✅ Изучение основ композиции
✅ Изучение колориметрии, колоростики, психологии цвета
✅ Изучение типографики
✅ Работа с различными типами графики
✅ Множество практических работ по созданию коммерческих проектов в социальных сетях - instagram, facebook, вконтакте, презентаций для инфопродуктов.'''

kurs_minecraft = '''Меняйте ваш игровой мир по своим правилам с помощью консоли игры Minecraft.

В ходе курса ребёнок изучит:

✅ Создание читов, модов и плагинов (дополнений) для Minecraft, которые могут использовать и другие игроки
✅ Основы программирования, в том числе сложные конструкции языка Python
✅ Основам прикладного программирования
✅ Создание игровых объектов'''

kurs_scratch = '''Успей присоединиться в увлекательное путешествие в мир программирования 🌎
Курс Scratch – это …
✅ Создание увлекательных игр и мультфильмом
✅ Применение знаний из математики и логики
✅ Освоение базовых понятий и
принципов программирования
✅ Создание крутых проектов в группе и индивидуально
✅ Реализация творческого потенциала ребенка'''

kurs_roblox = '''Текста нет, а фотка есть :з'''


#Папка с фото
photo = './media/'


#Ссылки
zapURL = 'https://cod.s20.online/common/1/form/draw?id=1'
groupVK = 'https://vk.com/codvn'
site = 'codschools.ru'
oplatURL = 'codschools.ru'
